* Example

#+CAPTION: Example Table
#+TBLNAME: example
| A                         | B                    | C [fn:example--1] | D [fn:example--4] |
|---------------------------+----------------------+-------------------+-------------------|
| 230498.10 [fn:example--2] | 0.06 [fn:example--3] |         230498.16 |              0.24 |
| 1203948501                | .08                  |     1203948501.08 |              0.28 |
#+TBLFM: $3=$2+$1::$4=sqrt($2)::@2$1=.10+230498::@2$2=2/35


#+CAPTION: Table A
#+TBLNAME: A
| A              | B              |
|----------------+----------------|
| 0.25 [fn:A--1] | 0.35 [fn:A--2] |
| 0.25 [fn:A--1] | 0.25 [fn:A--1] |
| 0.25 [fn:A--1] | 0.25 [fn:A--1] |
#+TBLFM: @2$1=.25::@2$2=.35::@3$1=.25::@3$2=.25::@4$1=.25::@4$2=.25


#+CAPTION: Table R
#+TBLNAME: R
|   | Year |          Sales |           COGS | Gross Margin [fn:R--1] |
|---+------+----------------+----------------+------------------------|
|   | 2012 |           1.04 |            .75 |                   0.29 |
|   | 2013 |           1.06 |            .80 |                   0.26 |
|   | 2014 |           1.08 |           0.85 |                   0.23 |
|   | 2015 |           1.10 |           0.91 |                   0.19 |
|   | 2016 | 1.12 [fn:R--2] | 0.97 [fn:R--2] |                   0.15 |
|   | 2020 | 1.20 [fn:R--2] | 1.24 [fn:R--2] |                  -0.05 |
#+TBLFM: $5=$Sales-$COGS::@6$3=@-1*(1+(@5-@4)/@4)::@6$4=@-1*(1+(@5-@4)/@4)::@7$3=@-1*(1+(@5-@4)/@4)::@7$4=@-1*(1+(@5-@4)/@4)::@8$3=@-1*(1+(@5-@4)/@4)::@8$4=@-1*(1+(@5-@4)/@4)::@9$3=@-1*(1+(@5-@4)/@4)::@9$4=@-1*(1+(@5-@4)/@4)::@10$3=@-1*(1+(@5-@4)/@4)::@10$4=@-1*(1+(@5-@4)/@4)::@11$3=@-1*(1+(@5-@4)/@4)::@11$4=@-1*(1+(@5-@4)/@4)::@13$3=@-1*(1+(@5-@4)/@4)::@13$4=@-1*(1+(@5-@4)/@4)

* Footnotes

[fn:R--1] \$Sales-\$COGS

[fn:R--2] @-1*(1+(@5-@4)/@4)

[fn:example--1] \$2+\$1

[fn:example--2] .10+230498

[fn:example--3] 2/35

[fn:example--4] sqrt(\$2)

[fn:A--1] .25

[fn:A--2] .35




